{
  "format": "layers-model",
  "generatedBy": "custom-exporter",
  "convertedBy": null,
  "modelTopology": {
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "image_enhancer",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "batch_normalization",
              "activation": "linear"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "batch_normalization_1",
              "activation": "linear"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "activation": "tanh"
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "dense/kernel",
          "shape": [
            35,
            128
          ],
          "dtype": "float32",
          "byteOffset": 0
        },
        {
          "name": "dense/bias",
          "shape": [
            128
          ],
          "dtype": "float32",
          "byteOffset": 17920
        },
        {
          "name": "dense_1/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32",
          "byteOffset": 18432
        },
        {
          "name": "dense_1/bias",
          "shape": [
            64
          ],
          "dtype": "float32",
          "byteOffset": 51200
        },
        {
          "name": "dense_2/kernel",
          "shape": [
            64,
            32
          ],
          "dtype": "float32",
          "byteOffset": 51456
        },
        {
          "name": "dense_2/bias",
          "shape": [
            32
          ],
          "dtype": "float32",
          "byteOffset": 59648
        },
        {
          "name": "dense_3/kernel",
          "shape": [
            32,
            3
          ],
          "dtype": "float32",
          "byteOffset": 59776
        },
        {
          "name": "dense_3/bias",
          "shape": [
            3
          ],
          "dtype": "float32",
          "byteOffset": 60160
        }
      ]
    }
  ],
  "layersMeta": [
    {
      "name": "dense",
      "activation": "relu",
      "kernelShape": [
        35,
        128
      ],
      "biasSize": 128
    },
    {
      "name": "dense_1",
      "activation": "relu",
      "kernelShape": [
        128,
        64
      ],
      "biasSize": 64
    },
    {
      "name": "dense_2",
      "activation": "relu",
      "kernelShape": [
        64,
        32
      ],
      "biasSize": 32
    },
    {
      "name": "dense_3",
      "activation": "tanh",
      "kernelShape": [
        32,
        3
      ],
      "biasSize": 3
    }
  ]
}